Revit 2026 API

# SpaceConditionType Property

---

Get or set the Condition type of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConditionType ConditionType { get; set; }
```
```vb
Public Property ConditionType As ConditionType
	Get
	Set
```
```cpp
public:
property ConditionType ConditionType {
	ConditionType get ();
	void set (ConditionType value);
}
```
```fsharp
member ConditionType : ConditionType with get, set
```

#### Property Value

ConditionType

This property is used to get or set the Condition type of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace